---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinTypen2
source: html/a89af1a0-5b04-5d17-56b5-56b12cb57949.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinTypen2 Property

"Alternating Bar - Type"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinTypen2 { get; }
```